# DeleteWorksetSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DeleteWorksetSettings Class
Members See Also
---
This class represents the settings used to delete a workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public class DeleteWorksetSettings : IDisposable
```

Visual Basic
---
```text
Public Class DeleteWorksetSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DeleteWorksetSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DeleteWorksetSettings
# See Also
DeleteWorksetSettings Members
Autodesk.Revit.DB Namespace